Repository: xcv58/MacTools
Catalog: Plugins/IPOverview/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# common.checking
source: 检测中
ar: التحقق
de: Prüfung
en: Checking
es: Comprobación
fr: Vérification
ja: 確認中
ko: 확인 중
pt: Verificando
ru: Проверка
tr: Kontrol ediliyor
zh_hant: 檢測中

# common.notDetected
source: 未检测到
ar: لم يتم اكتشافه
de: Nicht erkannt
en: Not detected
es: No detectado
fr: Non détecté
ja: 検出されません
ko: 감지되지 않음
pt: Não detectado
ru: Не обнаружено
tr: Algılanmadı
zh_hant: 未檢測到

# common.unknown
source: 未知
ar: غير معروف
de: Unbekannt
en: Unknown
es: Desconocido
fr: Inconnu
ja: 不明
ko: 알 수 없음
pt: Desconhecido
ru: Неизвестно
tr: Bilinmiyor

# common.waiting
source: 等待
ar: الانتظار
de: Warten
en: Waiting
es: Esperando
fr: En attente
ja: 待機中
ko: 대기 중
pt: Esperando
ru: Ожидание
tr: Bekliyor

# component.title
source: IP 检测
ar: فحص IP
de: IP-Prüfung
en: IP Check
es: Verificación de IP
fr: Vérification IP
ja: IP チェック
ko: IP 확인
pt: Verificação de IP
ru: Проверка IP
tr: IP Kontrolü
zh_hant: IP 檢測

# connectivity.error.invalidURL
source: URL 无效
ar: عنوان URL غير صالح
de: Ungültige URL
en: Invalid URL
es: URL no válido
fr: URL invalide
ja: 無効な URL
ko: 잘못된 URL
pt: URL inválido
ru: Неверный URL
tr: Geçersiz URL
zh_hant: URL 無效

# connectivity.refresh.help
source: 刷新连通性
ar: تحديث الاتصال
de: Konnektivität aktualisieren
en: Refresh connectivity
es: Actualizar conectividad
fr: Actualiser la connectivité
ja: 接続を更新
ko: 연결 새로 고침
pt: Atualizar conectividade
ru: Обновить подключение
tr: Bağlantıyı yenile
zh_hant: 刷新連通性

# connectivity.title
source: 网络连通性
ar: الاتصال
de: Konnektivität
en: Connectivity
es: Conectividad
fr: Connectivité
ja: 接続性
ko: 연결성
pt: Conectividade
ru: Подключение
tr: Bağlantı
zh_hant: 網絡連通性

# connectivity.unreachable
source: 不可达
ar: غير قابل للوصول
de: Nicht erreichbar
en: Unreachable
es: Inalcanzable
fr: Injoignable
ja: 到達不能
ko: 접근할 수 없음
pt: Inacessível
ru: Недоступно
tr: Erişilemiyor
zh_hant: 不可達

# customTarget.error.emptyName
source: 请输入名称
ar: أدخل اسمًا
de: Geben Sie einen Namen ein
en: Enter a name
es: Ingrese un nombre
fr: Entrez un nom
ja: 名前を入力してください
ko: 이름을 입력하세요
pt: Digite um nome
ru: Введите имя
tr: Bir ad girin
zh_hant: 請輸入名稱

# customTarget.error.invalidURL
source: 请输入有效 URL
ar: أدخل URL
de: Geben Sie einen gültigen URL ein
en: Enter a valid URL
es: Ingrese un URL
fr: Entrez un URL valide
ja: 有効な URL を入力してください
ko: 유효한 URL을(를) 입력하세요
pt: Insira um URL válido
ru: Введите действительный URL
tr: Geçerli bir URL girin
zh_hant: 請輸入有效 URL

# customTarget.name.placeholder
source: 名称
ar: الاسم
de: Name
en: Name
es: Nombre
fr: Nom
ja: 名前
ko: 이름
pt: Nome
ru: Имя
tr: Ad
zh_hant: 名稱

# detail.back.help
source: 返回概览
ar: الرجوع إلى النظرة العامة
de: Zurück zur Übersicht
en: Back to overview
es: Volver a la descripción general
fr: Retour à l'aperçu
ja: 概要に戻る
ko: 개요로 돌아가기
pt: Voltar à visão geral
ru: Вернуться к обзору
tr: Genel görünüme dön
zh_hant: 返回概覽

# detail.copyReport.help
source: 复制完整检测结果
ar: نسخ نتيجة الفحص الكاملة
de: Vollständiges Prüfergebnis kopieren
en: Copy full check result
es: Copiar el resultado completo de la comprobación
fr: Copier le résultat complet de la vérification
ja: 完全なチェック結果をコピー
ko: 전체 점검 결과 복사
pt: Copiar resultado completo da verificação
ru: Копировать полный результат проверки
tr: Tam kontrol sonucunu kopyala
zh_hant: 複製完整檢測結果

# detail.refresh.help
source: 刷新全部检测
ar: تحديث كافة عمليات التحقق
de: Alle Prüfungen aktualisieren
en: Refresh all checks
es: Actualizar todas las comprobaciones
fr: Actualiser toutes les vérifications
ja: すべてのチェックを更新
ko: 모든 검사 새로고침
pt: Atualizar todas as verificações
ru: Обновить все проверки
tr: Tüm kontrolleri yenile
zh_hant: 刷新全部檢測

# detail.title
source: IP 详情
ar: تفاصيل IP
de: IP-Details
en: IP Details
es: Detalles de IP
fr: Détails IP
ja: IP の詳細
ko: IP 세부정보
pt: Detalhes de IP
ru: Сведения об IP
tr: IP Ayrıntıları
zh_hant: IP 詳情

# dns.note
source: DNS 泄露（DNS Leaks）的意思是，当你挂上 VPN/代理后，你解析域名时，依然通过当地的运营商进行解析，这时就有 DNS 泄露的风险。\n\n泄露测试的方法是通过访问新生成的域名，检测你是通过哪个地区的 DNS 出口进行解析，如果返回的出口区域和你当地的运营商区域相同，则有 DNS 泄露风险，你可能需要修改 VPN/代理设置。
ar: تعني تسريبات نظام أسماء النطاقات (DNS) أنه بعد تمكين VPN أو وكيل، قد يستمر حل عمليات البحث عن النطاق بواسطة موفر خدمة الإنترنت المحلي لديك. يمكن أن يؤدي هذا إلى الكشف عن موقعك الحقيقي على الشبكة.\n\nيقوم هذا الاختبار بزيارة المجالات التي تم إنشاؤها حديثًا والتحقق من مخرج DNS الذي يحلها. إذا كانت منطقة الخروج تتطابق مع منطقة مزود خدمة الإنترنت المحلي لديك، فقد يكون لديك تسرب DNS وقد تحتاج إلى ضبط إعدادات VPN أو الخادم الوكيل.
de: DNS-Lecks bedeuten, dass Domain-Abfragen nach dem Aktivieren eines VPN oder Proxys weiterhin über Ihren lokalen ISP aufgelöst werden können. Das kann Ihren tatsächlichen Netzwerkstandort offenlegen. Dieser Test ruft neu generierte Domains auf und prüft, welcher DNS-Ausgang sie auflöst. Wenn dessen Region mit der Region Ihres lokalen ISP übereinstimmt, liegt möglicherweise ein DNS-Leck vor und Sie sollten Ihre VPN- oder Proxy-Einstellungen prüfen.
en: DNS leaks mean that after enabling a VPN or proxy, domain lookups may still be resolved by your local ISP. This can expose your real network location.\n\nThis test visits newly generated domains and checks which DNS exit resolves them. If the exit region matches your local ISP region, you may have a DNS leak and may need to adjust your VPN or proxy settings.
es: Una fuga de DNS significa que, después de activar una VPN o un proxy, las consultas de dominio aún pueden resolverse mediante tu ISP local. Esto puede revelar tu ubicación real de red. Esta prueba visita dominios recién generados y comprueba qué salida DNS los resuelve. Si la región de salida coincide con la de tu ISP local, puede haber una fuga de DNS y conviene revisar la configuración de VPN o proxy.
fr: Une fuite DNS signifie qu'après l'activation d'un VPN ou d'un proxy, les requêtes de domaine peuvent encore être résolues par votre FAI local. Cela peut révéler votre emplacement réseau réel. Ce test visite des domaines nouvellement générés et vérifie quelle sortie DNS les résout. Si sa région correspond à celle de votre FAI local, vous avez peut-être une fuite DNS et devriez vérifier vos paramètres VPN ou proxy.
ja: DNS リークとは、VPN やプロキシを有効にしていても、ドメイン照会がローカル ISP によって解決される状態です。実際のネットワーク所在地が露出する可能性があります。 このテストでは、新しく生成したドメインにアクセスし、どの DNS 出口で解決されたかを確認します。出口の地域がローカル ISP の地域と一致する場合は DNS リークの可能性があるため、VPN またはプロキシ設定を確認してください。
ko: DNS 누출은 VPN 또는 프록시를 활성화한 뒤에도 도메인 조회가 로컬 ISP를 통해 해석될 수 있음을 의미합니다. 이 경우 실제 네트워크 위치가 노출될 수 있습니다. 이 테스트는 새로 생성한 도메인에 접속해 어떤 DNS 출구에서 해석되는지 확인합니다. 출구 지역이 로컬 ISP 지역과 일치하면 DNS 누출 가능성이 있으므로 VPN 또는 프록시 설정을 확인하세요.
pt: Um vazamento de DNS significa que, depois de ativar uma VPN ou proxy, consultas de domínio ainda podem ser resolvidas pelo seu ISP local. Isso pode expor sua localização real na rede. Este teste acessa domínios recém-gerados e verifica qual saída DNS os resolve. Se a região de saída corresponder à região do seu ISP local, pode haver um vazamento de DNS e talvez seja preciso ajustar a VPN ou o proxy.
ru: Утечка DNS означает, что после включения VPN или прокси доменные запросы всё еще могут обрабатываться локальным провайдером. Это может раскрыть ваше реальное сетевое местоположение. Тест обращается к новым доменам и проверяет, через какой DNS-выход они разрешаются. Если регион выхода совпадает с регионом локального провайдера, возможна утечка DNS и стоит проверить настройки VPN или прокси.
tr: DNS sızıntısı; VPN veya vekil sunucu etkinleştirildikten sonra bile alan adı sorgularının yine yerel İSS'niz tarafından çözümlenmesi demektir. Bu durum, gerçek ağ konumunuzun ortaya çıkmasına yol açabilir.\n\nBu test, yeni oluşturulan alan adlarını ziyaret ederek bunların hangi DNS çıkışı tarafından çözümlendiğini kontrol eder. Çıkış bölgesi yerel İSS'nizin bölgesiyle eşleşiyorsa DNS sızıntınız olabilir ve VPN ya da vekil sunucu ayarlarınızı düzenlemeniz gerekebilir.
zh_hant: DNS 泄露（DNS Leaks）的意思是，當你掛上 VPN/代理後，你解析域名時，依然通過當地的運營商進行解析，這時就有 DNS 泄露的風險。\n\n泄露測試的方法是通過訪問新生成的域名，檢測你是通過哪個地區的 DNS 出口進行解析，如果返回的出口區域和你當地的運營商區域相同，則有 DNS 泄露風險，你可能需要修改 VPN/代理設定。

# dns.probe.name
source: DNS 出口检测 #%d
ar: التحقق من خروج DNS #%d
de: DNS-Exit-Prüfung #%d
en: DNS exit check #%d
es: Comprobación de salida de DNS #%d
fr: Vérification de sortie DNS #%d
ja: DNS 出口チェック #%d
ko: DNS 출구 확인 #%d
pt: Verificação de saída DNS #%d
ru: Проверка выхода DNS #%d
tr: DNS çıkış kontrolü #%d
zh_hant: DNS 出口檢測 #%d

# dns.title
source: DNS 泄漏测试
ar: اختبار تسرب DNS
de: DNS-Lecktest
en: DNS Leak Test
es: Prueba de fuga de DNS
fr: Test de fuite DNS
ja: DNS リークテスト
ko: DNS 누출 테스트
pt: Teste de vazamento de DNS
ru: Тест на утечку DNS
tr: DNS Sızıntı Testi
zh_hant: DNS 泄漏測試

# geo.proxy.notDetected
source: 未识别为代理
ar: لم يتم اكتشاف وكيل
de: Kein Proxy erkannt
en: No proxy detected
es: No se detectó ningún proxy
fr: Aucun proxy détecté
ja: プロキシが検出されませんでした
ko: 프록시가 감지되지 않음
pt: Nenhum proxy detectado
ru: Прокси-сервер не обнаружен
tr: Vekil sunucu algılanmadı
zh_hant: 未識別為代理

# geo.proxy.possible
source: 可能为代理
ar: الوكيل المحتمل
de: Möglicher Proxy
en: Possible proxy
es: Posible proxy
fr: Proxy possible
ja: 可能なプロキシ
ko: 가능한 프록시
pt: Possível proxy
ru: Возможный прокси
tr: Olası vekil sunucu
zh_hant: 可能為代理

# info.network
source: 网络
ar: الشبكة
de: Netzwerk
en: Network
es: Red
fr: Réseau
ja: ネットワーク
ko: 네트워크
pt: Rede
ru: Сеть
tr: Ağ
zh_hant: 網絡

# info.proxy
source: 代理
ar: الوكيل
de: Proxy
en: Proxy
es: Proxy
fr: Proxy
ja: プロキシ
ko: 프록시
pt: Proxy
ru: Прокси
tr: Vekil Sunucu

# info.timezone
source: 时区
ar: المنطقة الزمنية
de: Zeitzone
en: Time Zone
es: Zona horaria
fr: Fuseau horaire
ja: タイムゾーン
ko: 시간대
pt: Fuso horário
ru: Часовой пояс
tr: Saat Dilimi
zh_hant: 時區

# info.type
source: 类型
ar: النوع
de: Typ
en: Type
es: Tipo
fr: Type
ja: タイプ
ko: 유형
pt: Tipo
ru: Тип
tr: Tür
zh_hant: 類型

# ipCard.failed
source: 获取失败或不存在 %@ 地址
ar: تعذر الحصول على عنوان %@
de: Es konnte keine %@-Adresse abgerufen werden
en: Could not get a %@ address
es: No se pudo obtener una dirección %@
fr: Impossible d'obtenir une adresse %@
ja: %@ アドレスを取得できませんでした
ko: %@ 주소를 얻을 수 없습니다
pt: Não foi possível obter um endereço %@
ru: Не удалось получить адрес %@
tr: %@ adresi alınamadı
zh_hant: 獲取失敗或不存在 %@ 地址

# ipCard.geoUnavailable
source: 归属地信息获取中或不可用
ar: يتم تحميل معلومات الموقع أو أنها غير متاحة
de: Standortinformationen werden geladen oder sind nicht verfügbar
en: Location information is loading or unavailable
es: La información de ubicación se está cargando o no está disponible
fr: Les informations de localisation sont en cours de chargement ou indisponibles
ja: 位置情報が読み込まれているか、利用できない
ko: 위치 정보가 로드 중이거나 사용할 수 없습니다
pt: As informações de local estão sendo carregadas ou indisponíveis
ru: Информация о местоположении загружается или недоступна
tr: Konum bilgisi yükleniyor veya kullanılamıyor
zh_hant: 歸屬地信息獲取中或不可用

# ipCard.ipv4.title
source: IP 来源: IPCheck.ing IPv4
ar: مصدر IP: IPCheck.ing IPv4
de: IP-Quelle: IPCheck.ing IPv4
en: IP Source: IPCheck.ing IPv4
es: Fuente IP: IPCheck.ing IPv4
fr: Source IP : IPCheck.ing IPv4
ja: IP ソース: IPCheck.ing IPv4
ko: IP 소스: IPCheck.ing IPv4
pt: Fonte IP: IPCheck.ing IPv4
ru: Источник IP: IPCheck.ing IPv4
tr: IP Kaynağı: IPCheck.ing IPv4
zh_hant: IP 來源: IPCheck.ing IPv4

# ipCard.ipv6.title
source: IP 来源: IPCheck.ing IPv6
ar: مصدر IP: IPCheck.ing IPv6
de: IP-Quelle: IPCheck.ing IPv6
en: IP Source: IPCheck.ing IPv6
es: Fuente IP: IPCheck.ing IPv6
fr: Source IP : IPCheck.ing IPv6
ja: IP ソース: IPCheck.ing IPv6
ko: IP 소스: IPCheck.ing IPv6
pt: Fonte IP: IPCheck.ing IPv6
ru: Источник IP: IPCheck.ing IPv6
tr: IP Kaynağı: IPCheck.ing IPv6
zh_hant: IP 來源: IPCheck.ing IPv6

# landing.local
source: 本地
ar: محلي
de: Lokal
en: Local
es: Local
fr: Local
ja: ローカル
ko: 로컬
pt: Local
ru: Локальный
tr: Yerel

# landing.subtitle
source: 公网、归属地与连通性
ar: عنوان IP العام والموقع والاتصال
de: Öffentliche IP, Standort und Konnektivität
en: Public IP, location, and connectivity
es: IP pública, ubicación y conectividad
fr: IP publique, emplacement et connectivité
ja: パブリック IP、所在地、接続
ko: 공용 IP, 위치 및 연결
pt: IP público, localização e conectividade
ru: Публичный IP, местоположение и подключение
tr: Genel IP, konum ve bağlantı
zh_hant: 公網、歸屬地與連通性

# leak.error.noDNSExit
source: 未获取到 DNS 出口
ar: لم يتم العثور على مخرج DNS
de: Es wurde kein DNS-Exit gefunden
en: No DNS exit was found
es: No se encontró ninguna salida DNS
fr: Aucune sortie DNS n'a été trouvée
ja: DNS 出口が見つかりませんでした
ko: DNS 종료를 찾을 수 없습니다
pt: Nenhuma saída DNS foi encontrada
ru: Выход DNS не найден
tr: DNS çıkışı bulunamadı
zh_hant: 未獲取到 DNS 出口

# leak.exitRegion
source: 出口地区
ar: منطقة الخروج
de: Ausgangsregion
en: Exit Region
es: Región de salida
fr: Région de sortie
ja: 出口地域
ko: 출구 지역
pt: Região de saída
ru: Регион выхода
tr: Çıkış Bölgesi
zh_hant: 出口地區

# leak.failed
source: 获取失败
ar: فشل
de: Fehlgeschlagen
en: Failed
es: Error
fr: Échec
ja: 失敗
ko: 실패
pt: Falha
ru: Не удалось
tr: Başarısız
zh_hant: 獲取失敗

# leak.nat.portRestrictedOrSymmetric
source: 端口限制型或对称型
ar: مقيد بالمنفذ أو متماثل
de: Portbeschränkt oder symmetrisch
en: Port-restricted or symmetric
es: Puerto restringido o simétrico
fr: Port restreint ou symétrique
ja: ポート制限または対称
ko: 포트 제한 또는 대칭
pt: Restrito por porta ou simétrico
ru: Ограничение портов или симметричный
tr: Port kısıtlı veya simetrik
zh_hant: 端口限制型或對稱型

# leak.network
source: 网络
ar: الشبكة
de: Netzwerk
en: Network
es: Red
fr: Réseau
ja: ネットワーク
ko: 네트워크
pt: Rede
ru: Сеть
tr: Ağ
zh_hant: 網絡

# local.empty
source: 未检测到可用本地地址
ar: لم يتم العثور على عنوان محلي قابل للاستخدام
de: Keine verwendbare lokale Adresse gefunden
en: No usable local address found
es: No se encontró ninguna dirección local utilizable
fr: Aucune adresse locale utilisable trouvée
ja: 使用可能なローカル アドレスが見つかりません
ko: 사용 가능한 로컬 주소를 찾을 수 없습니다
pt: Nenhum endereço local utilizável encontrado
ru: Не найден подходящий локальный адрес
tr: Kullanılabilir yerel adres bulunamadı
zh_hant: 未檢測到可用本地地址

# local.title
source: 本地局域网 IP
ar: عنوان IP المحلي للشبكة المحلية
de: Lokale LAN-IP
en: Local LAN IP
es: IP de LAN local
fr: IP du réseau local
ja: ローカル LAN IP
ko: 로컬 LAN IP
pt: IP da LAN local
ru: IP-адрес локальной сети
tr: Yerel Ağ IP'si
zh_hant: 本地局域網 IP

# metadata.description
source: 查看公网 IP、本地地址和归属地
ar: عرض عنوان IP العام والعناوين المحلية والموقع.
de: Öffentliche IP, lokale Adressen und Standort anzeigen.
en: View public IP, local addresses, and location.
es: Ver IP pública, direcciones locales y ubicación.
fr: Affichez l'adresse IP publique, les adresses locales et l'emplacement.
ja: パブリック IP、ローカルアドレス、所在地を表示します。
ko: 공용 IP, 로컬 주소, 위치를 확인하세요.
pt: Ver IP público, endereços locais e localização.
ru: Просмотр публичного IP, локальных адресов и местоположения.
tr: Genel IP'yi, yerel adresleri ve konumu görüntüleyin.
zh_hant: 查看公網 IP、本地地址和歸屬地

# metadata.title
source: IP 检测
ar: التحقق من IP
de: IP-Prüfung
en: IP Check
es: Verificación de IP
fr: Vérification IP
ja: IP チェック
ko: IP 확인
pt: Verificação de IP
ru: Проверка IP
tr: IP Kontrolü
zh_hant: IP 檢測

# networkType.business
source: 企业网络
ar: شبكة الأعمال
de: Unternehmensnetzwerk
en: Business network
es: Red empresarial
fr: Réseau d'entreprise
ja: ビジネスネットワーク
ko: 비즈니스 네트워크
pt: Rede empresarial
ru: Деловая сеть
tr: Kurumsal ağ
zh_hant: 企業網絡

# networkType.datacenter
source: 数据中心
ar: مركز البيانات
de: Rechenzentrum
en: Data center
es: Centro de datos
fr: Centre de données
ja: データセンター
ko: 데이터 센터
pt: Centro de dados
ru: Центр обработки данных
tr: Veri merkezi
zh_hant: 數據中心

# networkType.education
source: 教育网络
ar: شبكة التعليم
de: Bildungsnetzwerk
en: Education network
es: Red educativa
fr: Réseau éducatif
ja: 教育ネットワーク
ko: 교육 네트워크
pt: Rede educacional
ru: Образовательная сеть
tr: Eğitim ağı
zh_hant: 教育網絡

# networkType.mobile
source: 移动网络
ar: شبكة الهاتف المحمول
de: Mobilfunknetz
en: Mobile network
es: Red móvil
fr: Réseau mobile
ja: モバイルネットワーク
ko: 모바일 네트워크
pt: Rede móvel
ru: Мобильная сеть
tr: Mobil ağ
zh_hant: 移動網絡

# networkType.residential
source: 住宅/宽带
ar: سكني/نطاق عريض
de: Wohnbereich/Breitband
en: Residential/broadband
es: Residencial/banda ancha
fr: Résidentiel/haut débit
ja: 住宅/ブロードバンド
ko: 주거용/광대역
pt: Residencial/banda larga
ru: Жилой/широкополосный доступ
tr: Ev/geniş bant
zh_hant: 住宅/寬帶

# panel.action.copyPublicIP
source: 复制公网 IP
ar: نسخ عنوان IP العام
de: Öffentliche IP kopieren
en: Copy Public IP
es: Copiar IP pública
fr: Copier l'adresse IP publique
ja: パブリック IP をコピー
ko: 공용 IP 복사
pt: Copiar IP público
ru: Копировать публичный IP
tr: Genel IP'yi Kopyala
zh_hant: 複製公網 IP

# panel.action.copyReport
source: 复制完整结果
ar: نسخ النتيجة الكاملة
de: Vollständiges Ergebnis kopieren
en: Copy Full Result
es: Copiar resultado completo
fr: Copier le résultat complet
ja: 結果全体をコピー
ko: 전체 결과 복사
pt: Copiar resultado completo
ru: Копировать полный результат
tr: Tam Sonucu Kopyala
zh_hant: 複製完整結果

# panel.action.openDetails
source: 打开详情
ar: افتح التفاصيل
de: Details öffnen
en: Open Details
es: Abrir detalles
fr: Ouvrir les détails
ja: 詳細を開く
ko: 세부정보 열기
pt: Abrir detalhes
ru: Открыть подробности
tr: Ayrıntıları Aç
zh_hant: 打開詳情

# panel.action.refreshAll
source: 刷新全部检测
ar: تحديث كافة عمليات التحقق
de: Alle Prüfungen aktualisieren
en: Refresh All Checks
es: Actualizar todas las comprobaciones
fr: Actualiser toutes les vérifications
ja: すべてのチェックを更新
ko: 모든 확인 새로고침
pt: Atualizar todas as verificações
ru: Обновить все проверки
tr: Tüm Kontrolleri Yenile
zh_hant: 刷新全部檢測

# panel.action.refreshing
source: 刷新中...
ar: تحديث...
de: Erfrischend…
en: Refreshing…
es: Refrescante…
fr: Rafraîchissant…
ja: さわやか…
ko: 새로고침…
pt: Atualizando…
ru: Обновление…
tr: Yenileniyor…

# panel.subtitle.refreshing
source: 正在检测公网 IP...
ar: جارٍ التحقق من عنوان IP العام...
de: Öffentliche IP prüfen…
en: Checking public IP…
es: Comprobando IP pública…
fr: Vérification de l'adresse IP publique…
ja: パブリック IP を確認しています…
ko: 공인 IP 확인 중…
pt: Verificando IP público…
ru: Проверка публичного IP…
tr: Genel IP kontrol ediliyor…
zh_hant: 正在檢測公網 IP...

# privacy.footer
source: 公网、归属地和连通性检测会请求外部服务；本地地址仅在本机读取。
ar: تطلب عمليات التحقق من عنوان IP العام والموقع والاتصال خدمات خارجية. تتم قراءة العناوين المحلية على جهاز Mac هذا فقط.
de: Öffentliche IP-, Standort- und Konnektivitätsprüfungen fordern externe Dienste an. Lokale Adressen sind auf diesem Mac schreibgeschützt.
en: Public IP, location, and connectivity checks request external services. Local addresses are read only on this Mac.
es: Las comprobaciones de conectividad, ubicación y IP pública solicitan servicios externos. Las direcciones locales son de solo lectura en esta Mac.
fr: Les vérifications d'adresse IP publique, d'emplacement et de connectivité nécessitent des services externes. Les adresses locales sont en lecture seule sur ce Mac.
ja: パブリック IP、所在地、接続の検査では外部サービスへリクエストします。ローカルアドレスはこの Mac 上でのみ読み取られます。
ko: 공용 IP, 위치, 연결 확인을 통해 외부 서비스를 요청합니다. 이 Mac에서는 로컬 주소를 읽을 수만 있습니다.
pt: As verificações de IP público, localização e conectividade solicitam serviços externos. Os endereços locais são somente leitura neste Mac.
ru: Проверки публичного IP, местоположения и подключения обращаются к внешним службам. Локальные адреса считываются только на этом Mac.
tr: Genel IP, konum ve bağlantı kontrolleri dış servislere istek gönderir. Yerel adresler yalnızca bu Mac'te okunur.
zh_hant: 公網、歸屬地和連通性檢測會請求外部服務；本地地址僅在本機讀取。

# report.city
source: 城市：%@
ar: المدينة: %@
de: Stadt: %@
en: City: %@
es: Ciudad: %@
fr: Ville : %@
ja: 都市: %@
ko: 도시: %@
pt: Cidade: %@
ru: Город: %@
tr: Şehir: %@

# report.error
source: 错误：%@
ar: خطأ: %@
de: Fehler: %@
en: Error: %@
es: Error: %@
fr: Erreur : %@
ja: エラー: %@
ko: 오류: %@
pt: Erro: %@
ru: Ошибка: %@
tr: Hata: %@
zh_hant: 錯誤：%@

# report.geo
source: 归属地：
ar: الموقع:
de: Standort:
en: Location:
es: Ubicación:
fr: Emplacement :
ja: 所在地:
ko: 위치:
pt: Localização:
ru: Местоположение:
tr: Konum:
zh_hant: 歸屬地：

# report.localAddresses
source: 本地地址：
ar: العناوين المحلية:
de: Lokale Adressen:
en: Local addresses:
es: Direcciones locales:
fr: Adresses locales :
ja: ローカルアドレス:
ko: 로컬 주소:
pt: Endereços locais:
ru: Локальные адреса:
tr: Yerel adresler:

# report.network
source: 网络：%@
ar: الشبكة: %@
de: Netzwerk: %@
en: Network: %@
es: Red: %@
fr: Réseau : %@
ja: ネットワーク: %@
ko: 네트워크: %@
pt: Rede: %@
ru: Сеть: %@
tr: Ağ: %@
zh_hant: 網絡：%@

# report.province
source: 省份：%@
ar: المنطقة: %@
de: Region: %@
en: Region: %@
es: Región: %@
fr: Région : %@
ja: 地域: %@
ko: 지역: %@
pt: Região: %@
ru: Регион: %@
tr: İl: %@

# report.proxy
source: 代理：%@
ar: الوكيل: %@
de: Proxy: %@
en: Proxy: %@
es: Proxy: %@
fr: Mandataire : %@
ja: プロキシ: %@
ko: 프록시: %@
pt: Proxy: %@
ru: Прокси: %@
tr: Vekil Sunucu: %@

# report.publicIPv4
source: 公网 IPv4：%@
ar: IPv4 العام: %@
de: Öffentliche IPv4: %@
en: Public IPv4: %@
es: IPv4 pública: %@
fr: IPv4 publique : %@
ja: パブリック IPv4: %@
ko: 공용 IPv4: %@
pt: IPv4 público: %@
ru: Публичный IPv4: %@
tr: Genel IPv4: %@
zh_hant: 公網 IPv4：%@

# report.publicIPv6
source: 公网 IPv6：%@
ar: IPv6 العام: %@
de: Öffentliche IPv6: %@
en: Public IPv6: %@
es: IPv6 pública: %@
fr: IPv6 publique : %@
ja: パブリック IPv6: %@
ko: 공용 IPv6: %@
pt: IPv6 público: %@
ru: Публичный IPv6: %@
tr: Genel IPv6: %@
zh_hant: 公網 IPv6：%@

# report.region
source: 地区：%@
ar: المنطقة: %@
de: Region: %@
en: Region: %@
es: Región: %@
fr: Région : %@
ja: 地域: %@
ko: 지역: %@
pt: Região: %@
ru: Регион: %@
tr: Bölge: %@
zh_hant: 地區：%@

# report.source
source: 来源：%@
ar: المصدر: %@
de: Quelle: %@
en: Source: %@
es: Fuente: %@
fr: Source : %@
ja: ソース: %@
ko: 출처: %@
pt: Fonte: %@
ru: Источник: %@
tr: Kaynak: %@
zh_hant: 來源：%@

# report.source.failure
source: - %@ %@：失败（%@）
ar: - %@ %@: فشل (%@)
de: - %@ %@: fehlgeschlagen (%@)
en: - %@ %@: failed (%@)
es: - %@ %@: falló (%@)
fr: - %@ %@ : échec (%@)
ja: - %@ %@: 失敗しました (%@)
ko: - %@ %@: 실패함(%@)
pt: - %@ %@: falhou (%@)
ru: - %@ %@: ошибка (%@)
tr: - %@ %@: başarısız (%@)
zh_hant: - %@ %@：失敗（%@）

# report.sources
source: 检测源：
ar: المصادر:
de: Quellen:
en: Sources:
es: Fuentes:
fr: Sources :
ja: ソース:
ko: 출처:
pt: Fontes:
ru: Источники:
tr: Kaynaklar:
zh_hant: 檢測源：

# report.timezone
source: 时区：%@
ar: المنطقة الزمنية: %@
de: Zeitzone: %@
en: Time Zone: %@
es: Zona horaria: %@
fr: Fuseau horaire : %@
ja: タイムゾーン: %@
ko: 시간대: %@
pt: Fuso horário: %@
ru: Часовой пояс: %@
tr: Saat Dilimi: %@
zh_hant: 時區：%@

# report.title
source: IP 检测结果
ar: نتيجة فحص IP
de: Ergebnis der IP-Prüfung
en: IP Check Result
es: Resultado de la comprobación de IP
fr: Résultat de la vérification IP
ja: IP チェック結果
ko: IP 확인 결과
pt: Resultado da verificação de IP
ru: Результат проверки IP
tr: IP Kontrol Sonucu
zh_hant: IP 檢測結果

# report.type
source: 类型：%@
ar: النوع: %@
de: Typ: %@
en: Type: %@
es: Tipo: %@
fr: Type : %@
ja: タイプ: %@
ko: 유형: %@
pt: Tipo: %@
ru: Тип: %@
tr: Tür: %@
zh_hant: 類型：%@

# report.updatedAt
source: 更新时间：%@
ar: تم التحديث: %@
de: Aktualisiert: %@
en: Updated: %@
es: Actualizado: %@
fr: Mise à jour : %@
ja: 更新日: %@
ko: 업데이트됨: %@
pt: Atualizado: %@
ru: Обновлено: %@
tr: Güncellendi: %@
zh_hant: 更新時間：%@

# service.error.invalidIP
source: IP 无效：%@
ar: عنوان IP غير صالح: %@
de: Ungültige IP: %@
en: Invalid IP: %@
es: IP no válida: %@
fr: IP invalide : %@
ja: 無効な IP: %@
ko: 잘못된 IP: %@
pt: IP inválido: %@
ru: Неверный IP: %@
tr: Geçersiz IP: %@
zh_hant: IP 無效：%@

# service.error.invalidPayload
source: 数据格式不正确
ar: تنسيق البيانات غير صالح
de: Ungültiges Datenformat
en: Invalid data format
es: Formato de datos no válido
fr: Format de données invalide
ja: 無効なデータ形式
ko: 잘못된 데이터 형식
pt: Formato de dados inválido
ru: Неверный формат данных
tr: Geçersiz veri biçimi
zh_hant: 數據格式不正確

# service.error.invalidResponse
source: 响应无效
ar: استجابة غير صالحة
de: Ungültige Antwort
en: Invalid response
es: Respuesta no válida
fr: Réponse invalide
ja: 無効な応答
ko: 잘못된 응답
pt: Resposta inválida
ru: Неверный ответ
tr: Geçersiz yanıt
zh_hant: 響應無效
